Tekla Open API Reference for Tekla Structures 2025
Edge Methods
The Edge type exposes the following members.
Methods
Name | Description
Clone
 Method for cloning the current object.
Top
See Also
Reference
Edge Class
Tekla.Structures.Solid Namespace